In [2]:
import numpy as np
import pandas as pd

In [4]:
labels=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30])
d={'a':10,'b':20,'c':30}

In [15]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [16]:
pd.Series(arr)

0    10
1    20
2    30
dtype: Int64

In [17]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: Int64

In [18]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [19]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [22]:
pd.Series([sum,print,len])

0    <function sum at 0x0000025986ECFF70>
1               <built-in function print>
2                 <built-in function len>
dtype: object

In [24]:
ser1=pd.Series([1,2,3,4],index=['USA','germany','USSR','Japan'])

In [25]:
ser1

USA        1
germany    2
USSR       3
Japan      4
dtype: int64

In [27]:
ser2=pd.Series([1,2,3,4],index=['USA','germany','Italy','Japan'])

In [28]:
ser2

USA        1
germany    2
Italy      3
Japan      4
dtype: int64

In [30]:
ser1['USA']

1

In [29]:
ser1+ser2

Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
germany    4.0
dtype: float64

In [43]:
import pandas as pd
import numpy as np
import random

In [44]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

NameError: name 'randn' is not defined

In [45]:
df

NameError: name 'df' is not defined

In [46]:
df.W

NameError: name 'df' is not defined

In [42]:
type(df(W))

NameError: name 'df' is not defined

In [47]:
df=pd.DataFrame({'A':[1,2,np.nan],
                'B':[5,np.nan,np.nan],
                'C':[1,2,3]})

In [48]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [49]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [50]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [51]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [52]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [53]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [55]:
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
     'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
     'Sales':[200,120,340,124,243,350]}

In [59]:
df=pd.DataFrame(data)

In [60]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [61]:
df.groupby('Company')

In [62]:
by_comp=df.groupby("Company")

In [63]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0